"""
1. Дан многомерный список. Вывести на экран первый и последний столбцы.

[1 6 8 5 4 0 3],
[5 7 8 9 4 2 1],
[6 0 7 8 1 2 5],
[5 7 2 7 5 2 1]

1 3
5 1
6 5
5 1
"""

sets_num = [
    [1, 6, 8, 5, 4, 0, 3],
    [5, 7, 8, 9, 4, 2, 1],
    [6, 0, 7, 8, 1, 2, 5],
    [5, 7, 2, 7, 5, 2, 1]
]

for i in range(len(sets_num)):
    print(sets_num[i][0], sets_num[i][-1])
